OdDAI.Session.closeSession
\details
Closes current session instance.
\remarks
This method is for internal use only.

OdDAI.Session.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.Session.deleteNPL(OdDAI.List&lt;OdDAI.OdDAIObjectSDAI**&gt;*)
\details
Deletes an instance of Non-Persistent List (NPL).
\param npl [in] A raw pointer to the non-persistent list to be deleted.

OdDAI.Session.createNPL
\details
Creates an instance of Non-Persistent List (NPL).
\returns A pointer to the created non-persistent list.

OdDAI.Session.resetEventCollector(OdSharedPtr&lt;OdDAI.IEventCollector&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets an event collector object to handle error events in the runtime.
\param eventCollector [out] A smart pointer to the custom event collector object.
\remarks
When a custom event collector object was set, the default event collector become inactive, therefore the recording of error events is not working.
To restore the default event collector and resume events recording, call this method without a parameter.

OdDAI.Session.stopEventRecording
\details
Deactivates the error events recording mode.

OdDAI.Session.startEventRecording
\details
Activates the error events recording mode.

OdDAI.Session.isRecordingOn
\details
Determines whether the error logging is on or off.
\returns true if the error events recording mode is on; otherwise, the method returns false.

OdDAI.Session.recordError(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Writes a record to the error event list.
\param functionID [in] A null-terminated string that contains the function name.
\param error      [in] An error identifier.
\param descpt     [in] A null-terminated string that contains the error description.

OdDAI.Session.#ctor
\details
Creates a new Session object with default parameters.